espruino/Espruino/targets/esp32/jshardware.c
JsVarFloat jshPinAnalog(Pin pin) {
  ESP_LOGD(tag,">> jshPinAnalog: pin=%d", pin);
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshPinAnalog");
  gpio_num_t gpioNum = pinToESP32Pin(pin);
  UNUSED(gpioNum);
  //return (JsVarFloat)system_adc1_read(gpioNum, 3); //TODO ESP32 not supported yet from SDK
  return (JsVarFloat)0;
}


int jshPinAnalogFast(Pin pin) {
  ESP_LOGD(tag,">> jshPinAnalogFast: pin=%d", pin);
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshPinAnalogFast");
  return 0;
}


/**
 * Set the output PWM value.
 */
JshPinFunction jshPinAnalogOutput(Pin pin,
    JsVarFloat value,
    JsVarFloat freq,
    JshAnalogOutputFlags flags) { // if freq<=0, the default is used
  UNUSED(value);
  UNUSED(freq);
  UNUSED(flags);

  ESP_LOGD(tag,">> jshPinAnalogOutput: pin=%d", pin);
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshPinAnalogOutput");
  return 0;
}


/**
 *
 */
void jshSetOutputValue(JshPinFunction func, int value) {
  UNUSED(func);
  UNUSED(value);
  ESP_LOGD(tag,">> JshPinFunction");
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< JshPinFunction");
}


/**
 *
 */
void jshEnableWatchDog(JsVarFloat timeout) {
  UNUSED(timeout);
  ESP_LOGD(tag,">> jshEnableWatchDog");
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshEnableWatchDog");
}


// Kick the watchdog
void jshKickWatchDog() {
  ESP_LOGD(tag,">> jshKickWatchDog");
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshKickWatchDog");
}


/**
 * Get the state of the pin associated with the event flag.
 */
bool CALLED_FROM_INTERRUPT jshGetWatchedPinState(IOEventFlags eventFlag) { // can be called at interrupt time
  gpio_num_t gpioNum = pinToESP32Pin(eventFlag-EV_EXTI0);
  bool level = gpio_get_level(gpioNum);
  return level;
}


/**
 * Set the value of the pin to be the value supplied and then wait for
 * a given period and set the pin value again to be the opposite.
 */
void jshPinPulse(
    Pin pin,              //!< The pin to be pulsed.
    bool pulsePolarity,   //!< The value to be pulsed into the pin.
    JsVarFloat pulseTime  //!< The duration in milliseconds to hold the pin.
) {
  UNUSED(pulseTime);
  ESP_LOGD(tag,">> jshPinPulse: pin=%d, polarity=%d", pin, pulsePolarity);
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshPinPulse");
}


/**
 * Determine whether the pin can be watchable.
 * \return Returns true if the pin is wathchable.
 */
bool jshCanWatch(
    Pin pin //!< The pin that we are asking whether or not we can watch it.
  ) {
  UNUSED(pin);
  return true; //lets assume all pins will do
}


/**
 * Do what ever is necessary to watch a pin.
 * \return The event flag for this pin.
 */
IOEventFlags jshPinWatch(
    Pin pin,         //!< The pin to be watched.
    bool shouldWatch //!< True for watching and false for unwatching.
  ) {
      gpio_num_t gpioNum = pinToESP32Pin(pin);
	  if(shouldWatch){
		gpio_set_intr_type(gpioNum,GPIO_INTR_ANYEDGE);             //set posedge interrupt
		gpio_set_direction(gpioNum,GPIO_MODE_INPUT);               //set as input
		gpio_set_pull_mode(gpioNum,GPIO_PULLUP_ONLY);              //enable pull-up mode
		gpio_intr_enable(gpioNum);                                 //enable interrupt
	  }
	  else{
		if(gpio_intr_disable(gpioNum) == ESP_ERR_INVALID_ARG){     //disable interrupt
			ESP_LOGE(tagGPIO,"*** jshPinWatch error");
		}
	  }
      return pin;
}


/**
 *
 */
JshPinFunction jshGetCurrentPinFunction(Pin pin) {
  ESP_LOGD(tag,">> jshGetCurrentPinFunction: pin=%d", pin);
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshGetCurrentPinFunction");
  return JSH_NOTHING;
}


/**
 * Determine if a given event is associated with a given pin.
 * \return True if the event is associated with the pin and false otherwise.
 */
bool jshIsEventForPin(
    IOEvent *event, //!< The event that has been detected.
    Pin pin         //!< The identity of a pin.
  ) {
  return IOEVENTFLAGS_GETTYPE(event->flags) == pinToEV_EXTI(pin);
}

//===== USART and Serial =====



void jshUSARTSetup(IOEventFlags device, JshUSARTInfo *inf) {
  UNUSED(device);
  UNUSED(inf);
  ESP_LOGD(tag,">> jshUSARTSetup");
  ESP_LOGD(tag,"<< jshUSARTSetup");
}

bool jshIsUSBSERIALConnected() {
  ESP_LOGD(tag,">> jshIsUSBSERIALConnected");
  ESP_LOGD(tag,"<< jshIsUSBSERIALConnected");
  return false; // "On non-USB boards this just returns false"
}

/**
 * Kick a device into action (if required).
 *
 */
void jshUSARTKick(
    IOEventFlags device //!< The device to be kicked.
) {
    //ESP_LOGD(tag,">> jshUSARTKick");
  int c = jshGetCharToTransmit(device);
  while(c >= 0) {
    uart_tx_one_char((uint8_t)c);
    c = jshGetCharToTransmit(device);
  }
  //ESP_LOGD(tag,"<< jshUSARTKick");
}

//===== SPI =====

/**
 * Initialize the hardware SPI device.
 * On the ESP32, hardware SPI is implemented via a set of default pins defined
 * as follows:
 *
 *
 */
void jshSPISetup(
    IOEventFlags device, //!< The identity of the SPI device being initialized.
    JshSPIInfo *inf      //!< Flags for the SPI device.
) {
  ESP_LOGD(tag,">> jshSPISetup device=%s, baudRate=%d, spiMode=%d, spiMSB=%d",
      jshGetDeviceString(device),
      inf->baudRate,
      inf->spiMode,
      inf->spiMSB);
  spi_t *spi = NULL;
  uint8_t dataMode = SPI_MODE0;
  switch(inf->spiMode) {
  case 0:
    dataMode = SPI_MODE0;
    break;
  case 1:
    dataMode = SPI_MODE1;
    break;
  case 2:
    dataMode = SPI_MODE2;
    break;
  case 3:
    dataMode = SPI_MODE3;
    break;
  }
  uint8_t bitOrder;
  if (inf->spiMSB == true) {
    bitOrder = SPI_MSBFIRST;
  } else {
    bitOrder = SPI_LSBFIRST;
  }
  switch(device) {
  case EV_SPI1:
    HSPI_spi = spiStartBus(HSPI, 1000000, dataMode, bitOrder);
    spi = HSPI_spi;
    break;
  case EV_SPI2:
    VSPI_spi = spiStartBus(VSPI, 1000000, dataMode, bitOrder);
    spi = VSPI_spi;
    break;
  default:
    ESP_LOGW(tag, "Unexpected device for SPI initialization: %d", device);
    break;
  }
  if (spi != NULL) {
    spiAttachSCK(spi, -1);
    spiAttachMISO(spi, -1);
    spiAttachMOSI(spi, -1);
    spiAttachSS(spi, 0, -1);
    spiEnableSSPins(spi, 1<<0);
    spiSSEnable(spi);
  }
  ESP_LOGD(tag,"<< jshSPISetup");
}


/** Send data through the given SPI device (if data>=0), and return the result
 * of the previous send (or -1). If data<0, no data is sent and the function
 * waits for data to be returned */
int jshSPISend(
    IOEventFlags device, //!< The identity of the SPI device through which data is being sent.
    int data             //!< The data to be sent or an indication that no data is to be sent.
) {
  ESP_LOGD(tag,">> jshSPISend device=%s, data=%x", jshGetDeviceString(device), data);
  spi_t *spi;
  switch(device) {
  case EV_SPI1:
    spi = HSPI_spi;
    break;
  case EV_SPI2:
    spi= VSPI_spi;
    break;
  default:
    return -1;
  }

  if (device != EV_SPI1 && device != EV_SPI2) {
    return -1;
  }

  //os_printf("> jshSPISend - device=%d, data=%x\n", device, data);
  int retData = (int)g_lastSPIRead;
  if (data >=0) {
    // Send 8 bits of data taken from "data" over the selected spi and store the returned
    // data for subsequent retrieval.
    spiTransferBits(spi, (uint32_t)data, &g_lastSPIRead, 8);
  } else {
    g_lastSPIRead = (uint32_t)-1;
  }
  ESP_LOGD(tag,"<< jshSPISend");
  return (int)retData;
}


/**
 * Send 16 bit data through the given SPI device.
 */
void jshSPISend16(
    IOEventFlags device, //!< Unknown
    int data             //!< Unknown
) {
  UNUSED(device);
  UNUSED(data);
  ESP_LOGD(tag,">> jshSPISend16");
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshSPISend16");
}


/**
 * Set whether to send 16 bits or 8 over SPI.
 */
void jshSPISet16(
    IOEventFlags device, //!< Unknown
    bool is16            //!< Unknown
) {
  UNUSED(device);
  UNUSED(is16);
  ESP_LOGD(tag,">> jshSPISet16");
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshSPISet16");
}


/**
 * Wait until SPI send is finished.
 */
void jshSPIWait(
    IOEventFlags device //!< Unknown
) {
  UNUSED(device);
  ESP_LOGD(tag,">> jshSPIWait");
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshSPIWait");
}


