espruino/Espruino/targets/esp32/jshardware.c
/** Set whether to use the receive interrupt or not */
void jshSPISetReceive(IOEventFlags device, bool isReceive) {
  UNUSED(device);
  UNUSED(isReceive);
  ESP_LOGD(tag,">> jshSPISetReceive");
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshSPISetReceive");
}

//===== I2C =====

/** Set-up I2C master for ESP8266, default pins are SCL:12, SDA:13. Only device I2C1 is supported
 *  and only master mode. */
void jshI2CSetup(IOEventFlags device, JshI2CInfo *info) {
  UNUSED(device);
  UNUSED(info);
}


void jshI2CWrite(IOEventFlags device,
    unsigned char address,
    int nBytes,
    const unsigned char *data,
    bool sendStop) {
  UNUSED(device);
  UNUSED(address);
  UNUSED(nBytes);
  UNUSED(data);
  UNUSED(sendStop);
  ESP_LOGD(tag,">> jshI2CWrite");
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshI2CWrite");
}

void jshI2CRead(IOEventFlags device,
    unsigned char address,
    int nBytes,
    unsigned char *data,
    bool sendStop) {
  UNUSED(device);
  UNUSED(address);
  UNUSED(nBytes);
  UNUSED(data);
  UNUSED(sendStop);
  ESP_LOGD(tag,">> jshI2CRead");
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshI2CRead");
}

//===== System time stuff =====

/* The esp8266 has two notions of system time implemented in the SDK by system_get_time()
 * and system_get_rtc_time(). The former has 1us granularity and comes off the CPU cycle
 * counter, the latter has approx 57us granularity (need to check) and comes off the RTC
 * clock. Both are 32-bit counters and thus need some form of roll-over handling in software
 * to produce a JsSysTime.
 *
 * It seems pretty clear from the API and the calibration concepts that the RTC runs off an
 * internal RC oscillator or something similar and the SDK provides functions to calibrate
 * it WRT the crystal oscillator, i.e., to get the current clock ratio. The only benefit of
 * RTC timer is that it keeps running when in light sleep mode. (It also keeps running in
 * deep sleep mode since it can be used to exit deep sleep but some brilliant engineer at
 * espressif decided to reset the RTC timer when coming out of deep sleep so the time is
 * actually lost!)
 *
 * It seems that the best course of action is to use the system timer for jshGetSystemTime()
 * and related functions and to use the rtc timer only to preserve time during light sleep.
 */

/**
 * Given a time in milliseconds as float, get us the value in microsecond
 */
JsSysTime jshGetTimeFromMilliseconds(JsVarFloat ms) {
  //ESP_LOGD(tag,">> jshGetTimeFromMilliseconds");
  return (JsSysTime) (ms * 1000.0 + 0.5);
  //ESP_LOGD(tag,"<< jshGetTimeFromMilliseconds");
}

/**
 * Given a time in microseconds, get us the value in milliseconds (float)
 */
JsVarFloat jshGetMillisecondsFromTime(JsSysTime time) {
  ESP_LOGD(tag,">> jshGetMillisecondsFromTime");
  ESP_LOGD(tag,"<< jshGetMillisecondsFromTime");
  return (JsVarFloat) time / 1000.0;
}


/**
 * Return the current time in microseconds.
 */
JsSysTime CALLED_FROM_INTERRUPT jshGetSystemTime() { // in us -- can be called at interrupt time
  //ESP_LOGD(tag,">> jshGetSystemTime"); // Can't debug log as called too often.
  JsSysTime retTime = (JsSysTime)system_get_time();
  //ESP_LOGD(tag,"<< jshGetSystemTime");  // Can't debug log as called too often.
  return retTime;
}


/**
 * Set the current time in microseconds.
 */
void jshSetSystemTime(JsSysTime newTime) {
  UNUSED(newTime);
  ESP_LOGD(tag,">> jshSetSystemTime");
  ESP_LOGD(tag,"<< jshSetSystemTime");
}



void jshUtilTimerDisable() {
  ESP_LOGD(tag,">> jshUtilTimerDisable");
  ESP_LOGD(tag,"<< jshUtilTimerDisable");
}

void jshUtilTimerStart(JsSysTime period) {
  UNUSED(period);
  ESP_LOGD(tag,">> jshUtilTimerStart");
  ESP_LOGD(tag,"<< jshUtilTimerStart");
}

void jshUtilTimerReschedule(JsSysTime period) {
  ESP_LOGD(tag,">> jshUtilTimerReschedule");
  jshUtilTimerDisable();
  jshUtilTimerStart(period);
  ESP_LOGD(tag,"<< jshUtilTimerReschedule");
}

//===== Miscellaneous =====

bool jshIsDeviceInitialised(IOEventFlags device) {
  UNUSED(device);
  ESP_LOGD(tag,">> jshIsDeviceInitialised");
  ESP_LOGD(tag,"<< jshIsDeviceInitialised");
 return 0;
} // End of jshIsDeviceInitialised

// the esp8266 doesn't have any temperature sensor
JsVarFloat jshReadTemperature() {
  ESP_LOGD(tag,">> jshReadTemperature");
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshReadTemperature");
  return NAN;
}

// the esp8266 can read the VRef but then there's no analog input, so we don't support this
JsVarFloat jshReadVRef() {
  ESP_LOGD(tag,">> jshReadVRef");
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshReadVRef");
  return NAN;
}

unsigned int jshGetRandomNumber() {
  ESP_LOGD(tag,">> jshGetRandomNumber");
  ESP_LOGD(tag,"<< jshGetRandomNumber");
  return (unsigned int)rand();
}

//===== Read-write flash =====

/**
 * Determine available flash depending on EEprom size
 *
 */
uint32_t jshFlashMax() {
  ESP_LOGD(tag,">> jshFlashMax");
  return (FLASH_MAX-1);
}

/**
 * Read data from flash memory into the buffer.
 *
 * This reads from flash using memory-mapped reads. Only works for the first 1MB and
 * requires 4-byte aligned reads.
 *
 */
void jshFlashRead(
    void *buf,     //!< buffer to read into
    uint32_t addr, //!< Flash address to read from
    uint32_t len   //!< Length of data to read
  ) {

  if(len == 1){ // Can't read a single byte using the API, so read 4 and select the byte requested
    uint word;
    spi_flash_read(addr & 0xfffffffc,&word,4);
	*(uint8_t *)buf = (word >> ((addr & 3) << 3 )) & 255;
  }
  else spi_flash_read(addr, buf, len);
}


/**
 * Write data to flash memory from the buffer.
 *
 * This is called from jswrap_flash_write and ... which guarantee that addr is 4-byte aligned
 * and len is a multiple of 4.
 */
void jshFlashWrite(
    void *buf,     //!< Buffer to write from
    uint32_t addr, //!< Flash address to write into
    uint32_t len   //!< Length of data to write
  ) {
  // This function is called too often during save() and load() processing to be
  // useful for logging the entry/exit.
  //ESP_LOGD(tag,">> jshFlashWrite");
  spi_flash_write(addr, buf, len);
  //ESP_LOGD(tag,"<< jshFlashWrite");
}


/**
 * Return start address and size of the flash page the given address resides in.
 * Returns false if no page.
 */
bool jshFlashGetPage(
    uint32_t addr,       //!<
    uint32_t *startAddr, //!<
    uint32_t *pageSize   //!<
  ) {
  ESP_LOGD(tag,">> jshFlashGetPage: addr=0x%x", addr);
  if (addr >= FLASH_MAX) return false;
  *startAddr = addr & ~(FLASH_PAGE-1);
  *pageSize = FLASH_PAGE;
  return true; 
}



JsVar *jshFlashGetFree() {
  ESP_LOGD(tag,">> jshFlashGetFree");
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshFlashGetFree");
  return 0;
}


/**
 * Erase the flash page containing the address.
 */
void jshFlashErasePage(
    uint32_t addr //!<
  ) {
  ESP_LOGD(tag,">> jshFlashErasePage: addr=0x%x", addr);
  spi_flash_erase_sector(addr >> FLASH_PAGE_SHIFT);
  ESP_LOGD(tag,"<< jshFlashErasePage");
}

unsigned int jshSetSystemClock(JsVar *options) {
  UNUSED(options);
  ESP_LOGD(tag,">> jshSetSystemClock");
  ESP_LOGD(tag, "Not implemented");
  ESP_LOGD(tag,"<< jshSetSystemClock");
  return 0;
}

/**
 * Convert an Espruino pin id to a native ESP32 pin id.
 * Notes: It is likely that this can be optimized by taking advantage of the
 * underlying implementation of the ESP32 data types but at this time, let us
 * leave as this explicit algorithm until the dust settles.
 */
static gpio_num_t pinToESP32Pin(Pin pin) {
  switch(pin) {
  case 0:
    return GPIO_NUM_0;
  case 1:
    return GPIO_NUM_1;
  case 2:
    return GPIO_NUM_2;
  case 3:
    return GPIO_NUM_3;
  case 4:
    return GPIO_NUM_4;
  case 5:
    return GPIO_NUM_5;
  case 6:
    return GPIO_NUM_6;
  case 7:
    return GPIO_NUM_7;
  case 8:
    return GPIO_NUM_8;
  case 9:
    return GPIO_NUM_9;
  case 10:
    return GPIO_NUM_10;
  case 11:
    return GPIO_NUM_11;
  case 12:
    return GPIO_NUM_12;
  case 13:
    return GPIO_NUM_13;
  case 14:
    return GPIO_NUM_14;
  case 15:
    return GPIO_NUM_15;
  case 16:
    return GPIO_NUM_16;
  case 17:
    return GPIO_NUM_17;
  case 18:
    return GPIO_NUM_18;
  case 19:
    return GPIO_NUM_19;
  case 21:
    return GPIO_NUM_21;
  case 22:
    return GPIO_NUM_22;
  case 23:
    return GPIO_NUM_23;
  case 25:
    return GPIO_NUM_25;
  case 26:
    return GPIO_NUM_26;
  case 27:
    return GPIO_NUM_27;
  case 32:
    return GPIO_NUM_32;
  case 33:
    return GPIO_NUM_33;
  case 34:
    return GPIO_NUM_34;
  case 35:
    return GPIO_NUM_35;
  case 36:
    return GPIO_NUM_36;
  case 37:
    return GPIO_NUM_37;
  case 38:
    return GPIO_NUM_38;
  case 39:
    return GPIO_NUM_39;
  }
  ESP_LOGE(tag, "pinToESP32Pin: Unknown pin: %d", pin);
  return -1;
}
